app/Http/Controllers/LessonController.php

    public function show(int $lesson_id)
    {
        $user = \Auth::user();
        $lesson = Lesson::with(['questions.answers', 'topic'])->find($lesson_id);
        $lesson_status = UserStatus::firstOrCreate(
            [
                'lesson_id' => $lesson->id,
                'user_id' => $user->id
            ],
            [
                'attempt' => 0,
                'count_true_answers' => 0,
                'current_duration' => 0,
                'is_success' => false,
                'max_attempt' => 3,
                'max_duration' => 1000,
                'threshold' => 80
            ]
        );
---
select * from `answers` where `answers`.`question_id` in (1, 2, 3, 4)
select * from `lessons` where `lessons`.`id` = 1 limit 1
select * from `questions` where `questions`.`lesson_id` in (1)
select * from `topics` where `topics`.`id` in (1)
select * from `user_statuses` where (`lesson_id` = 1 and `user_id` = 1) limit 1