app/Http/Controllers/TopicController.php

select * from `topics`
---
    public function index()
    {
        $topics = Topic::all();